# <center>Pandas Assignment</center>

Import pandas and numpy with their aliases

In [2]:
import numpy as np
import pandas as pd

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [2]:
a = pd.Series([ 100, 200, 300, 400])

Print a, and data type

In [3]:
print(a)
print(type(a))

0    100
1    200
2    300
3    400
dtype: int64
<class 'pandas.core.series.Series'>

Using indexing access the element 300 from the series a.

In [4]:
print(a[2])

300

What are the values of index for series a?

In [6]:
print(a.index)

RangeIndex(start=0, stop=4, step=1)

Change the index to  ['c', 'a', 'b', 'd']

In [7]:
a.index = ['c', 'a', 'b', 'd']
print(a)

c    100
a    200
b    300
d    400
dtype: int64

Access the value in the series with index 'd'

In [9]:
print(a['d'])

400

Sort the values wrt to the index and print it

In [10]:
sorted_a = a.sort_index()
print(sorted_a)

a    200
b    300
c    100
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

In [12]:
b = pd.Series([800,450,100])
b.index = ['e','f','g']
print(b)

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [14]:
a = pd.concat([sorted_a, b])
print(a)

a    200
b    300
c    100
d    400
e    800
f    450
g    100
dtype: int64

In [15]:
#print a again after appending b into it
a = pd.concat([a,b])
print(a)

a    200
b    300
c    100
d    400
e    800
f    450
g    100
e    800
f    450
g    100
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [45]:
# Sorted values in descending order
value_desc = a.sort_values(ascending = False)

# print sorted series
print(value_desc)

e    800
e    800
f    450
f    450
d    400
b    300
a    200
c    100
g    100
g    100
dtype: int64

In [46]:
# print index of sorted series

print(value_desc.index)

Index(['e', 'e', 'f', 'f', 'd', 'b', 'a', 'c', 'g', 'g'], dtype='object')

## Pandas DataFrame

### Part 1

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [52]:
df = pd.DataFrame({'Values':[200,300,100,400,800,450,100]}, index =['a','b','c','d','e','f','g'])
df

   Values
a     200
b     300
c     100
d     400
e     800
f     450
g     100

What is the shape of the datafarme <br>
(also, what does it imply?)

In [36]:
df.shape

(7, 1)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a'

In [37]:
# yep its same as the series.
df.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [38]:
df.head()

   Values
a     200
b     300
c     100
d     400
e     800

In [39]:
df.tail()

   Values
c     100
d     400
e     800
f     450
g     100

In [ ]:
# The head() and tail() functions in a Pandas DataFrame are used to view a specific number of rows from the beginning or the end of DataFrame, respectively. Normally, head() returns 
# first 5 rows and tail() returns last 5 rows. if we pass parameter as arguments inside head() function and tail() function, then head() and tail() print that no of rows .

Rename the column of the dataframe as 'points'

In [53]:
df.columns = ['points']
df

   points
a     200
b     300
c     100
d     400
e     800
f     450
g     100

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

In [25]:
#Create fruits array

fruits = np.array(['orange','mango','apple','banana','strawberry','pineapple','cherry'])
print(fruits)

['orange' 'mango' 'apple' 'banana' 'strawberry' 'pineapple' 'cherry']

In [27]:
#Create series fruits out of fruits array

fruits = pd.Series(['orange','mango','apple','banana','strawberry','pineapple','cherry'])
print(fruits)

0        orange
1         mango
2         apple
3        banana
4    strawberry
5     pineapple
6        cherry
dtype: object

Change the index of fruits to the index of dataframe df

In [44]:
fruits= pd.DataFrame({'Fruits':['orange','mango','apple','banana','strawberry','pineapple','cherry']}, index =['a','b','c','d','e','f','g'])
fruits

       Fruits
a      orange
b       mango
c       apple
d      banana
e  strawberry
f   pineapple
g      cherry

Add this fruits series as a new column to the dataframe df with its column name as 'fruits'
<br>print the head of the dataframe to verify

In [54]:
df = pd.concat([df, fruits], axis = 1)
df

   points      Fruits
a     200      orange
b     300       mango
c     100       apple
d     400      banana
e     800  strawberry
f     450   pineapple
g     100      cherry

In [55]:
df.head()

   points      Fruits
a     200      orange
b     300       mango
c     100       apple
d     400      banana
e     800  strawberry

## Pandas Concatenation

Create a dataframe  d1 where the cols are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [90]:
d1 = pd.DataFrame({'City': ['Chandigarh', 'Delhi', 'Kanpur', 'Chennai', 'Manali'],
                     'Temperature':[15, 22, 20, 26,-2]})

Print(d1)

In [91]:
d1

         City  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [60]:
d1.shape

(5, 2)

Set city = d1['city']

In [61]:
d1['City']

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: City, dtype: object

print city <br>
What is the type of city.

In [64]:
print(d1['City'])
print(type('City'))

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: City, dtype: object
<class 'str'>

Create another datafeame 'd2' where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [65]:
d2 = pd.DataFrame({'City':  ['Bengalaru','Coimbatore','Srirangam','Pondicherry'],
                     'Temperature':[24,35,36,39]})

print the shape of this dataframe

In [67]:
d2.shape

(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [69]:
d3 = pd.concat([d1,d2], axis = 0)
d3

          City  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

Select the part of the dataframe such that it contains cities wherer temp is less then or equal to 20 <br>
How many cities are there?

In [72]:
d3[d3['Temperature'] <= 20]

         City  Temperature
0  Chandigarh           15
2      Kanpur           20
4      Manali           -2

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [73]:
d3[d3['Temperature'] >= 35]

          City  Temperature
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

## Applying functions to columns and creating new columns

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not.
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [75]:
# write function here

def is_ut(x):
   union_territories = ['Chandigarh', 'Pondicherry', 'Delhi']
   return x in union_territories

d3['is_ut'] = d3['City'].apply(is_ut)

In [76]:
# print d3
d3

          City  Temperature  is_ut
0   Chandigarh           15   True
1        Delhi           22   True
2       Kanpur           20  False
3      Chennai           26  False
4       Manali           -2  False
0    Bengalaru           24  False
1   Coimbatore           35  False
2    Srirangam           36  False
3  Pondicherry           39   True

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT -
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [81]:
# write function here
def c_to_f(celsius):
    return celsius * 9/5 + 32

d3['Temperature_Fahrenheit'] = d3['Temperature'].apply(c_to_f)

In [82]:
# check function c_to_f(10)
c_to_f(10)

50.0

In [79]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'
d3['Tempera_Fahrenheit'] = d3['Temperature'].apply(c_to_f)

## Indexing and selecting rows in DataFrame

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [85]:
union_territories = ['Chandigarh', 'Delhi', 'Pondicherry']

subset_d1 = d1[d1['City'].isin(union_territories)]
subset_d1

         City  Temperature
0  Chandigarh           15
1       Delhi           22

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

In [86]:
def c_to_f(celsius):
    return celsius * 9/5 + 32
    
# convert the temperatures celcious to Fahrenheit
d1['Temperature_Fahrenheit'] = d1['Temperature'].apply(c_to_f)

subset_d1 = d1[d1['Temperature_Fahrenheit'] > 90]
subset_d1

Empty DataFrame
Columns: [City, Temperature, Temperature_Fahrenheit]
Index: []

Select only the first three rows of the dataframe d1.

In [92]:
d1.head(3)

         City  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20

Select all the rows and last two columns in the dataframe.

In [94]:
d1.iloc[:, :]

         City  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

## Groupby

In [95]:
# Create a dataframe using dictionary of your choice

data = pd.DataFrame({
    'Name':['Ankit','Soumya','Sanket','Sanskar','Ritika','Pratik'],
    'Age': [23,21,22,23,20,22]})

In [5]:
# Use Groupby of single column with aggregate sum()
df = pd.DataFrame({
    'Category': ['A', 'B', 'A', 'C', 'B', 'C', 'A'],
    'Values': [10, 20, 30, 40, 50, 60, 70]})
print(df)

grouped_df = df.groupby('Category')['Values'].sum()
grouped_df

  Category  Values
0        A      10
1        B      20
2        A      30
3        C      40
4        B      50
5        C      60
6        A      70

Category
A    110
B     70
C    100
Name: Values, dtype: int64

In [6]:
# Use Groupby of single column with aggregate count()
df = pd.DataFrame({
    'Category': ['A', 'B', 'A', 'C', 'B', 'C', 'A'],
    'Values': [10, 20, 30, 40, 50, 60, 70]})
print(df)

grouped_df = df.groupby('Category')['Values'].count()
grouped_df

  Category  Values
0        A      10
1        B      20
2        A      30
3        C      40
4        B      50
5        C      60
6        A      70

Category
A    3
B    2
C    2
Name: Values, dtype: int64

In [9]:
# Use Groupby of single column with aggregate min() and max()
df = pd.DataFrame({
    'Category': ['A', 'B', 'A', 'C', 'B', 'C', 'A'],
    'Values': [10, 20, 30, 40, 50, 60, 70]})
print(df)

grouped_df = df.groupby('Category')['Values'].agg(['min', 'max'])
grouped_df

  Category  Values
0        A      10
1        B      20
2        A      30
3        C      40
4        B      50
5        C      60
6        A      70

          min  max
Category
A          10   70
B          20   50
C          40   60

In [11]:
# Use Groupby of any 2 columns with aggregate mean()
df = pd.DataFrame({
    'Category': ['A', 'B', 'C','A','B','C'],
    'Subcategory': ['X','X','X','Y','Y','Y'],
    'Values': [10, 20, 30, 40, 50, 60]})
print(df)

grouped = df.groupby(['Category', 'Subcategory'])['Values'].mean()
grouped

  Category Subcategory  Values
0        A           X      10
1        B           X      20
2        C           X      30
3        A           Y      40
4        B           Y      50
5        C           Y      60

Category  Subcategory
A         X              10.0
          Y              40.0
B         X              20.0
          Y              50.0
C         X              30.0
          Y              60.0
Name: Values, dtype: float64

In [13]:
# Use Groupby of any 2 columns with aggregate min() and max()
df = pd.DataFrame({
    'Category': ['A', 'B', 'C','A','B', 'C','A','B','C','A','B','C'],
    'Subcategory': ['X','X','Y','Y','Y','X','X','X','Y','Y','Y','X'],
    'Values': [10, 20, 30, 40, 50, 60, 70, 80, 90, 60, 70, 80] })
print(df)

grouped = df.groupby(['Category', 'Subcategory'])['Values'].agg(['min', 'max'])
grouped

   Category Subcategory  Values
0         A           X      10
1         B           X      20
2         C           Y      30
3         A           Y      40
4         B           Y      50
5         C           X      60
6         A           X      70
7         B           X      80
8         C           Y      90
9         A           Y      60
10        B           Y      70
11        C           X      80

                      min  max
Category Subcategory
A        X             10   70
         Y             40   60
B        X             20   80
         Y             50   70
C        X             60   80
         Y             30   90